Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.cluster_ca_certificate will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cluster_ca_certificate"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
    }

  # data.template_file.gke_host_endpoint will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "gke_host_endpoint"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
    }

  # google_container_node_pool.node_pool will be created
+ resource "google_container_node_pool" "node_pool" {
      + cluster             = "gke-gitops"
      + id                  = (known after apply)
      + initial_node_count  = 1
      + instance_group_urls = (known after apply)
      + location            = "europe-west1-b"
      + max_pods_per_node   = (known after apply)
      + name                = "main-pool"
      + name_prefix         = (known after apply)
      + node_count          = (known after apply)
      + node_locations      = (known after apply)
      + project             = "lab-gitops"
      + version             = (known after apply)

      + autoscaling {
          + max_node_count = 5
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 30
          + disk_type         = "pd-standard"
          + guest_accelerator = (known after apply)
          + image_type        = "COS"
          + labels            = {
              + "all-pools-example" = "true"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n1-standard-1"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + tags              = [
              + "private",
              + "helm-example",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }
        }

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + update = "30m"
        }

      + upgrade_settings {
          + max_surge       = 1
          + max_unavailable = 0
        }
    }

  # kubernetes_cluster_role_binding.user will be created
+ resource "kubernetes_cluster_role_binding" "user" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "admin-user"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ServiceAccount"
          + name      = "276837832970-compute"
          + namespace = "default"
        }
      + subject {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Group"
          + name      = "system:masters"
          + namespace = "default"
        }
    }

  # null_resource.configure_kubectl will be created
+ resource "null_resource" "configure_kubectl" {
      + id = (known after apply)
    }

  # module.gke_cluster.google_container_cluster.cluster will be created
+ resource "google_container_cluster" "cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = false
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = false
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west1-b"
      + logging_service             = "logging.googleapis.com/kubernetes"
      + master_version              = (known after apply)
      + min_master_version          = "1.16.9-gke.2"
      + monitoring_service          = "monitoring.googleapis.com/kubernetes"
      + name                        = "gke-gitops"
      + network                     = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + project                     = "lab-gitops"
      + remove_default_node_pool    = true
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = false
            }

          + http_load_balancing {
              + disabled = false
            }

          + istio_config {
              + auth     = (known after apply)
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = (known after apply)

          + auto_provisioning_defaults {
              + oauth_scopes    = (known after apply)
              + service_account = (known after apply)
            }

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "private-services"
          + create_subnetwork             = (known after apply)
          + node_ipv4_cidr_block          = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "private-services"
          + subnetwork_name               = (known after apply)
          + use_ip_aliases                = (known after apply)
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "05:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + master_authorized_networks_config {
          + cidr_blocks {
              + cidr_block   = "0.0.0.0/0"
              + display_name = "all-for-testing"
            }
        }

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = (known after apply)
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = (known after apply)
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "10.5.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)
        }

      + release_channel {
          + channel = (known after apply)
        }

      + vertical_pod_autoscaling {
          + enabled = false
        }
    }

  # module.gke_service_account.google_project_iam_member.service_account-roles["roles/logging.logWriter"] will be created
+ resource "google_project_iam_member" "service_account-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "lab-gitops"
      + role    = "roles/logging.logWriter"
    }

  # module.gke_service_account.google_project_iam_member.service_account-roles["roles/monitoring.metricWriter"] will be created
+ resource "google_project_iam_member" "service_account-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "lab-gitops"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.gke_service_account.google_project_iam_member.service_account-roles["roles/monitoring.viewer"] will be created
+ resource "google_project_iam_member" "service_account-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "lab-gitops"
      + role    = "roles/monitoring.viewer"
    }

  # module.gke_service_account.google_project_iam_member.service_account-roles["roles/stackdriver.resourceMetadata.writer"] will be created
+ resource "google_project_iam_member" "service_account-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "lab-gitops"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.gke_service_account.google_service_account.service_account will be created
+ resource "google_service_account" "service_account" {
      + account_id   = "cluster-sa"
      + display_name = "GKE Cluster Service Account managed by Terraform"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "lab-gitops"
      + unique_id    = (known after apply)
    }

  # module.vpc_network.google_compute_network.vpc will be created
+ resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "gke-gitops-network-rw44-network"
      + project                         = "lab-gitops"
      + routing_mode                    = "REGIONAL"
      + self_link                       = (known after apply)
    }

  # module.vpc_network.google_compute_router.vpc_router will be created
+ resource "google_compute_router" "vpc_router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "gke-gitops-network-rw44-router"
      + network            = (known after apply)
      + project            = "lab-gitops"
      + region             = "europe-west1"
      + self_link          = (known after apply)
    }

  # module.vpc_network.google_compute_router_nat.vpc_nat will be created
+ resource "google_compute_router_nat" "vpc_nat" {
      + icmp_idle_timeout_sec              = 30
      + id                                 = (known after apply)
      + name                               = "gke-gitops-network-rw44-nat"
      + nat_ip_allocate_option             = "AUTO_ONLY"
      + project                            = "lab-gitops"
      + region                             = "europe-west1"
      + router                             = "gke-gitops-network-rw44-router"
      + source_subnetwork_ip_ranges_to_nat = "LIST_OF_SUBNETWORKS"
      + tcp_established_idle_timeout_sec   = 1200
      + tcp_transitory_idle_timeout_sec    = 30
      + udp_idle_timeout_sec               = 30

      + subnetwork {
          + name                     = (known after apply)
          + secondary_ip_range_names = []
          + source_ip_ranges_to_nat  = [
              + "ALL_IP_RANGES",
            ]
        }
    }

  # module.vpc_network.google_compute_subnetwork.vpc_subnetwork_private will be created
+ resource "google_compute_subnetwork" "vpc_subnetwork_private" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.3.16.0/20"
      + name                     = "gke-gitops-network-rw44-subnetwork-private"
      + network                  = (known after apply)
      + private_ip_google_access = true
      + project                  = "lab-gitops"
      + region                   = "europe-west1"
      + secondary_ip_range       = [
          + {
              + ip_cidr_range = "10.4.16.0/20"
              + range_name    = "private-services"
            },
        ]
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_10_MIN"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc_network.google_compute_subnetwork.vpc_subnetwork_public will be created
+ resource "google_compute_subnetwork" "vpc_subnetwork_public" {
      + creation_timestamp       = (known after apply)
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.3.0.0/20"
      + name                     = "gke-gitops-network-rw44-subnetwork-public"
      + network                  = (known after apply)
      + private_ip_google_access = true
      + project                  = "lab-gitops"
      + region                   = "europe-west1"
      + secondary_ip_range       = [
          + {
              + ip_cidr_range = "10.4.0.0/20"
              + range_name    = "public-services"
            },
        ]
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_10_MIN"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.vpc_network.module.network_firewall.data.google_compute_subnetwork.private_subnetwork will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_subnetwork" "private_subnetwork"  {
      + description              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = (known after apply)
      + network                  = (known after apply)
      + private_ip_google_access = (known after apply)
      + project                  = (known after apply)
      + region                   = (known after apply)
      + secondary_ip_range       = (known after apply)
      + self_link                = (known after apply)
    }

  # module.vpc_network.module.network_firewall.data.google_compute_subnetwork.public_subnetwork will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_subnetwork" "public_subnetwork"  {
      + description              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = (known after apply)
      + network                  = (known after apply)
      + private_ip_google_access = (known after apply)
      + project                  = (known after apply)
      + region                   = (known after apply)
      + secondary_ip_range       = (known after apply)
      + self_link                = (known after apply)
    }

  # module.vpc_network.module.network_firewall.google_compute_firewall.private_allow_all_network_inbound will be created
+ resource "google_compute_firewall" "private_allow_all_network_inbound" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + id                 = (known after apply)
      + name               = "gke-gitops-network-rw44-private-allow-ingress"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "lab-gitops"
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "private",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # module.vpc_network.module.network_firewall.google_compute_firewall.private_allow_restricted_network_inbound will be created
+ resource "google_compute_firewall" "private_allow_restricted_network_inbound" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + id                 = (known after apply)
      + name               = "gke-gitops-network-rw44-allow-restricted-inbound"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "lab-gitops"
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + source_tags        = [
          + "private",
          + "private-persistence",
        ]
      + target_tags        = [
          + "private-persistence",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # module.vpc_network.module.network_firewall.google_compute_firewall.public_allow_all_inbound will be created
+ resource "google_compute_firewall" "public_allow_all_inbound" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + id                 = (known after apply)
      + name               = "gke-gitops-network-rw44-public-allow-ingress"
      + network            = (known after apply)
      + priority           = 1000
      + project            = "lab-gitops"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "public",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://af208fb01c10:4141/lock?id=lvincel%252Fzen-gke%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
